app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES('Michael Hartl', 'michael@example.com', '2021-06-21 07:11:28', '2021-06-21 07:11:28')